{
  "basic_info": {
    "description_header": "Welcome",
    "description": "👋 We are from Salesians of Don Bosco Ng Siu Mui Secondary School. Our team is formed by dedicated teachers and students working hand in hand to develop innovative technological solutions that bring real change to the community.\n\nGuided by the spirit of \"Learning by Doing\", our teachers and students work closely together to integrate cutting-edge technology with genuine human care, addressing the real needs of our society. Our many award-winning projects are the best testament to this joint effort, showcasing our shared commitment to education, creativity, and advanced technology.\n\nYou are warmly invited to explore our achievements together with us! 💪🏻\n\n📧 Contact us: fta@sdbnsm.edu.hk",
    "section_name": {
      "about": "About Our Team",
      "projects": "Our Products",
      "skills": "Technical Skills",
      "experience": "Team Experience"
    }
  },
  "projects": [
    {
      "title": "Smart Learning Health APP 2026",
      "startDate": "2026",
      "description": "An innovative health education platform that integrates multiple features to promote healthy lifestyles among students and the community.\n\n👥 TEAM:\n• Teacher Advisor: Ms. Sally Tam\n• Students: Development team from F.4-F.5\n\n💚 KEY FEATURES:\n• AI Health Dialogue Bot - Chatbot providing health consultations\n• BMI Calculator with Recommendations - Health and nutrition advice based on metrics\n• Interactive Health Quiz Game - Gamified learning experience teaching health knowledge\n• Health Kit Integration - Connection with health monitoring tools\n\n🎯 PROJECT GOALS:\nMaking health education fun, accessible, and personalized for students.\n\n💡 TECHNOLOGIES:\nUsing Scratch programming, App Inventor, HTML/CSS, and basic JavaScript.",
      "images": [
        "images/portfolio/smart-health-app/p1.jpg",
        "images/portfolio/smart-health-app/p2.jpg",
        "images/portfolio/smart-health-app/p3.jpg"
      ],
      "url": "",
      "technologies": [
        {
          "class": "devicon-python-plain",
          "name": "Scratch"
        },
        {
          "class": "devicon-android-plain",
          "name": "App Inventor"
        },
        {
          "class": "devicon-html5-plain",
          "name": "HTML/CSS"
        }
      ]
    },
    {
      "title": "IEEE TALE 2025 - International Education Conference",
      "startDate": "2025",
      "description": "IEEE TALE (Technology and Learning) is the IEEE Education Society's flagship Asia-Pacific conference series, catering to researchers and practitioners with an interest in engineering, technology, and integrated STEAM education. The conference welcomes those interested in the innovative use of digital technologies for learning, teaching, and assessment in any discipline.\n\n🌏 CONFERENCE HIGHLIGHTS:\n• Hosted by Macao Polytechnic University from December 4-7, 2025\n• Theme: 'Innovation in Engineering Technology & Integrated STEAM Education'\n• Over 100 global experts and industry leaders from higher education, VET, K-12, corporate, government, and healthcare sectors\n• Platform for cross-regional and cross-disciplinary international cooperation\n\n👥 TEAM:\n• Teacher Advisor: Ms. Sally Tam (Future Talent Academy)\n• Students: NFC Smart Supermarket Development Team\n\n🏆 ACHIEVEMENTS:\n• Invited to present NFC Smart Supermarket project at international conference\n• Technical exchange and showcase at Macao Polytechnic University\n• International recognition of innovative technology education work\n• Networking with global education technology experts\n\n💡 SIGNIFICANCE:\nOur NFC project caught international attention, demonstrating how secondary school students can contribute to cutting-edge technology education. This invitation validates our 'Learning by Doing' approach and positions NSM Tech Team on the global stage of educational innovation.",
      "images": [
        "images/portfolio/ieee-tale-2025/p1.jpeg",
        "images/portfolio/ieee-tale-2025/p2.jpeg",
        "images/portfolio/ieee-tale-2025/p3.jpeg"
      ],
      "url": "",
      "technologies": [
        {
          "class": "devicon-python-plain",
          "name": "NFC Tech"
        },
        {
          "class": "devicon-android-plain",
          "name": "App Inventor"
        },
        {
          "class": "devicon-nodejs-plain",
          "name": "IoT"
        }
      ]
    },
    {
      "title": "7th Greater Bay Area STEAM Excellence Awards 2025",
      "startDate": "2025",
      "description": "The Greater Bay Area STEAM Excellence Awards recognize outstanding achievements in Science, Technology, Engineering, Arts, and Mathematics education across Hong Kong, Macau, and Guangdong Province. This prestigious competition showcases innovative projects that demonstrate excellence in STEAM education and real-world problem-solving.\n\n👥 TEAM:\n• Teacher Advisor: Ms. Sally Tam (Future Talent Academy)\n• Students: Chow Ching Kiu (5A), Ho Kwok Wang (5A), Mou Sun Yik Fan (5A)\n• Project: NFC Mei Kee Smart Supermarket\n\n🏆 ACHIEVEMENTS:\n• Merit Award - Information & Communications Technology Category (Secondary School Division)\n• Award ceremony held at Hong Kong Computer and Communications Festival\n• Recognition for innovative application of NFC technology in elderly care\n• Demonstrated excellence in integrating technology with social responsibility\n\n💡 SIGNIFICANCE:\nThis award validates our team's commitment to using technology for social good. The NFC Smart Supermarket project not only showcases technical innovation but also addresses real community needs - helping elderly people with visual impairment access product information easily. Being recognized in the Greater Bay Area competition highlights the regional impact of our work and our contribution to STEAM education excellence.\n\n🎯 PROJECT IMPACT:\nThe award reinforces our belief that secondary school students can create meaningful technology solutions that serve society. It motivates our team to continue developing innovative projects that combine technical skills with humanistic care.",
      "images": [
        "images/portfolio/innovation-tech-fair-2025/p1.jpg"
      ],
      "url": "",
      "technologies": [
        {
          "class": "devicon-arduino-plain",
          "name": "NFC Tech"
        },
        {
          "class": "devicon-android-plain",
          "name": "App Inventor"
        },
        {
          "class": "devicon-python-plain",
          "name": "IoT"
        }
      ]
    },
    {
      "title": "WICO Korea World Invention Creativity Competition",
      "startDate": "2024",
      "description": "Students traveled to Seoul, Korea during summer vacation to participate in the WICO World Invention Creativity Competition. This prestigious international competition attracted teams from various countries, providing an excellent opportunity for cross-cultural exchange and innovation sharing.\n\n👥 TEAM:\n• Teacher Advisors: Mr. Choi, Mr. Tang\n• Students: Hung Yin (5A), Yu Tsz Hang (5A), Wong Ngo Hin (5A), Yip Wang Ban (4A), Chow Ching Kiu (4A)\n\nAfter thorough preparation, both teams presented their innovative projects to the judges, successfully demonstrating their designs and functionalities. Despite acknowledging areas for improvement, they left a strong impression on the judges with their creativity and technical skills.\n\n🏆 ACHIEVEMENTS:\n• Silver Award - WICO Korea World Invention Creativity Competition 2024\n• International recognition from judges and peers\n• Cross-cultural exchange with teams from multiple countries\n• Valuable experience in international competition environment\n\n🎓 This experience not only validated students' innovative capabilities but also broadened their horizons through meaningful cultural exchange and learning opportunities.",
      "images": [
        "images/portfolio/wico-korea/p1.jpg",
        "images/portfolio/wico-korea/p2.jpg",
        "images/portfolio/wico-korea/p3.jpg"
      ],
      "url": "",
      "technologies": [
        {
          "class": "devicon-arduino-plain",
          "name": "Arduino"
        },
        {
          "class": "devicon-raspberrypi-line",
          "name": "micro:bit"
        },
        {
          "class": "devicon-figma-plain",
          "name": "Design"
        }
      ]
    },
    {
      "title": "Fun-Tech Competition 2024/25",
      "startDate": "2025",
      "description": "The Fun-Tech Competition organized by Hong Kong Polytechnic University showcases innovative applications of RFID and NFC technology. This competition encourages students to develop creative solutions that apply emerging technologies to solve real-world problems.\n\n👥 TEAM:\n• Teacher Advisor: Ms. Sally Tam (Future Talent Academy)\n• Students: Chow Ching Kiu (5A), Ho Kwok Wang (5A), Mou Sun Yik Fan (5A)\n• Project: NFC Mei Kee Smart Supermarket\n\n🏆 ACHIEVEMENT:\n• Champion - Creative RFID Category\n• Award ceremony held at Hong Kong Polytechnic University\n• Student representative Mou Sun Yik Fan presented project concept on stage\n\n💡 SIGNIFICANCE:\nWinning the championship in the Creative RFID category validates our innovative application of NFC technology for elderly care. The project demonstrated how students can leverage emerging technologies to create meaningful solutions that address community needs. The team continues to refine the design to benefit more people in need.\n\n🎯 COMPETITION JOURNEY:\nStarting from April 2025, the team went through three rounds of offline selection and successfully advanced to the finals, showcasing their dedication and technical excellence.",
      "images": [
        "images/portfolio/fun-tech-2024-25/p1.jpg"
      ],
      "url": "",
      "technologies": [
        {
          "class": "devicon-arduino-plain",
          "name": "NFC/RFID"
        },
        {
          "class": "devicon-android-plain",
          "name": "App Inventor"
        },
        {
          "class": "devicon-python-plain",
          "name": "IoT"
        }
      ]
    },
    {
      "title": " 👑 NFC Mei Kee Smart Supermarket (NFC 梅記智能超市)",
      "startDate": "2024",
      "description": "An innovative NFC-based smart shopping system designed to help elderly people with visual impairment. Using NFC (Near Field Communication) technology, users can access product information through their smartphones with enhanced font sizes, color contrast, and clear labeling. The system combines AI and NFC technology to make healthy eating, elderly-friendly shopping, and environmental sustainability easier and more accessible.\n\n👥 TEAM:\n• Teacher Advisor: Ms. Sally Tam (Future Talent Academy)\n• Students: Chow King Yuen (4A), Chow Ching Kiu (5A), Ho Kwok Wang (5A), Mou Sun Yik Fan (5A)\n\n🏆 ACHIEVEMENTS:\n• Merit Award - 7th Greater Bay Area STEAM Excellence Awards 2025 (Information & Communications Technology Category, Secondary Division)\n• 3rd Place - Student Innovation Competition 2025 (Hong Kong EdCity) - Senior Secondary Category\n• Award ceremony at Hong Kong Computer and Communications Festival\n• Presented at Hong Kong Convention and Exhibition Centre during Learning and Teaching Expo 2025\n• Award presented by Mr. Lee Hon Cheung, Chairman of Hong Kong EdCity\n\n📰 Media Coverage: https://www.stheadline.com/knowledge/3467783/",
      "images": [
        "images/portfolio/nfc-smart-supermarket/p1.jpg",
        "images/portfolio/nfc-smart-supermarket/p2.jpg",
        "images/portfolio/nfc-smart-supermarket/p3.jpg",
        "images/portfolio/nfc-smart-supermarket/p4.jpg"
      ],
      "url": "https://www.stheadline.com/knowledge/3467783/",
      "technologies": [
        {
          "class": "devicon-arduino-plain",
          "name": "NFC Tech"
        },
        {
          "class": "devicon-android-plain",
          "name": "App Inventor"
        },
        {
          "class": "devicon-python-plain",
          "name": "Python"
        }
      ]
    },
    {
      "title": "\"Let the Glacier Cool\" STEAM Competition",
      "startDate": "2025",
      "description": "Participated in Will Legend \"Let the Glacier Cool\" Conservation & Education Programme. Students learned about Third Pole glaciers' role in global climate and designed innovative solutions for glacier conservation.\n\n👥 TEAM: Mr. Marco Wong (黃瑋俊) | Form 5 Biology students\n🏆 ACHIEVEMENT: Finalist Award (Top 3)\n🌍 THEME: Conserving the Third Pole through Sustainability",
      "images": [
        "images/portfolio/glacier-conservation/p1.jpeg",
        "images/portfolio/glacier-conservation/p2.jpeg"
      ],
      "url": "",
      "technologies": [
        {
          "class": "devicon-python-plain",
          "name": "STEAM"
        },
        {
          "class": "devicon-nodejs-plain",
          "name": "Conservation"
        },
        {
          "class": "devicon-arduino-plain",
          "name": "Innovation"
        }
      ]
    },
    {
      "title": "Farmunity STEAM Education Programme",
      "startDate": "2025",
      "description": "Collaboration with Farmacy (agritech company) for indoor smart hydroponic farming education. Students apply innovative agricultural technology while serving the community through vegetable donation to low-income families.\n\n👥 TEAM: Mr. Marco Wong (黃瑋俊) | Farmacy Partnership\n🌱 FEATURES: Smart hydroponics | Botanical learning | Community service\n💚 IMPACT: Fresh vegetables donated to disadvantaged groups",
      "images": [
        "images/portfolio/farmunity-hydroponic/p1.jpeg",
        "images/portfolio/farmunity-hydroponic/p2.jpeg",
        "images/portfolio/farmunity-hydroponic/p3.jpeg"
      ],
      "url": "",
      "technologies": [
        {
          "class": "devicon-python-plain",
          "name": "Hydroponics"
        },
        {
          "class": "devicon-nodejs-plain",
          "name": "Smart Farming"
        },
        {
          "class": "devicon-raspberrypi-line",
          "name": "IoT"
        }
      ]
    },
    {
      "title": "Sustainable Development Ambassador Programme",
      "startDate": "2025",
      "description": "The school has been awarded the \"Sustainable Development Community Project Award\" under the Sustainable Development Schools Award Scheme organised by the Environment and Ecology Bureau for three consecutive years. Over the past three years, a total of 28 individuals from the school have been recognised as \"Sustainable Development Ambassador Leaders\" and \"Sustainable Development Ambassadors\".\n\n🏆 ACHIEVEMENTS:\n• 3 consecutive years - \"Sustainable Development Community Project Award\"\n• 28 students recognised as \"Sustainable Development Ambassador Leaders\" and \"Sustainable Development Ambassadors\" over 3 years\n• 2025: \"Devotion of Promotion of Sustainable Development Honour Award\"\n\n👥 RECOGNITION:\nThis year, the school has further received the prestigious \"Devotion of Promotion of Sustainable Development Honour Award\", in recognition of the significant contributions made by the school and its students in promoting and putting sustainable development concepts into practice.\n\n🌍 PROGRAMME HIGHLIGHTS:\n• Organised by Environment and Ecology Bureau\n• Focus on sustainable development education and community projects\n• Student leadership development in environmental initiatives\n• Long-term commitment to sustainability practices\n\n💡 IMPACT:\nThis programme demonstrates the school's dedication to cultivating environmental awareness and sustainable practices among students, preparing them to become responsible global citizens who actively contribute to building a sustainable future.",
      "images": [
        "images/portfolio/sustainable-development-ambassador/p1.jpeg",
        "images/portfolio/sustainable-development-ambassador/p2.jpeg",
        "images/portfolio/sustainable-development-ambassador/p3.jpeg"
      ],
      "url": "",
      "technologies": [
        {
          "class": "devicon-python-plain",
          "name": "Sustainability"
        },
        {
          "class": "devicon-nodejs-plain",
          "name": "Leadership"
        },
        {
          "class": "devicon-arduino-plain",
          "name": "Community"
        }
      ]
    }
  ],
  "experience": [
    {
      "company": "NSM Tech Team",
      "title": "Team Leader - Ms. Sally Tam",
      "years": "2022 - Present",
      "mainTech": [
        "Educational Technology"
      ],
      "technologies": [
        "Team Management",
        "Project Planning",
        "Curriculum Development",
        "Innovation",
        "Mentorship",
        "STEM Education"
      ]
    },
    {
      "company": "NSM Tech Team",
      "title": "Developer - Matthew Choi",
      "years": "2023 - Present",
      "mainTech": [
        "Full-Stack Development"
      ],
      "technologies": [
        "React",
        "Node.js",
        "Python",
        "JavaScript",
        "IoT Development",
        "UI/UX Design"
      ]
    },
    {
      "company": "NSM Tech Team",
      "title": "Developer - Natiate Tang",
      "years": "2023 - Present",
      "mainTech": [
        "AI & Machine Learning"
      ],
      "technologies": [
        "Python",
        "Machine Learning",
        "Data Analysis",
        "Arduino",
        "Raspberry Pi",
        "Hardware Integration"
      ]
    }
  ]
}